/*
(1) 2차원 배열 및 변수 생성
int arr[9][9]={
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
    {1,2,3,4,5,6,7,8,9},
}
(2) 81개 데이터 전부 넣기 - 열(i),행(j)
(3) 행별로 하나씩 탐색 
    - result에 값 넣어서 큰 값 나올때마다 갱신
    - 갱신될 때, 행열값 저장 
(4) 최종 result값 및 행열 값 출력
*/

#include <stdio.h>

int main(){
    //(1)
    int max, row, col,arr[9][9];// 9*9 2차원 배열
    max = 0;

    //(2)
    for (int i=0; i<9; i++){ // i = 행
        for (int j=0; j<9; j++){ // j = 열
            scanf("%d",&arr[i][j]); // error : scanf("%d",arr[i][j]) - 출력값 안 나옴. 입력 자체가 안되는 듯

            //(3)
            if(max < arr[i][j]){
                max = arr[i][j];
                row = i+1;
                col = j+1;
                // printf("%d \n%d \n%d",max,row,col);
            }
        }
    }
    //(4)
    printf("%d \n%d %d",max,row,col);
}